#Importando bibliotecas e realizando configurações

In [ ]:
import psycopg2
import pandas as pd

conn = psycopg2.connect(host="tuffi.db.elephantsql.com", database="asiodfak", user="asiodfak", password="O1JF6GvgfDG7Bc13JRdVEEYUmgF5Q6FJ")

#9.1 CONSULTAS DAS TABELAS COM TODOS OS DADOS INSERIDOS (Todas)

### Objetivo: Obter todos os dados da tabela "PESSOA"

In [ ]:
pd.read_sql_query("select * from pessoa", conn)

   cod_pessoa  fk_cod_grupo_familiar nome_pessoa          cpf data_nascimento
0           1                      1    Kelvin L  12345678901      1998-08-15
1           2                      1   Valdeci G  21343546984      1977-09-03
2           3                      1     Clara L  08775263728      2007-12-20
3           4                      1     Kelen L  08635243647      1979-07-05

### Objetivo: Obter todos os dados da tabela "GRUPO_FAMILIAR"

In [ ]:
pd.read_sql_query("select * from grupo_familiar", conn)

   cod_grupo_familiar nome_grupo_familiar
0                   1          Minha Casa

### Objetivo: Obter todos os dados da tabela "FORNECEDOR"

In [ ]:
pd.read_sql_query("select * from fornecedor", conn)

   cod_fornecedor nome_fornecedor
0               1           MegaG
1               2   Ryu Alimentos
2               3             G2F
3               4       Distrimed

### Objetivo: Obter todos os dados da tabela "PESSOA_CONSOME"

In [ ]:
pd.read_sql_query("select * from pessoa_consome", conn)

   cod_pessoa_consome  fk_cod_produto  fk_cod_pessoa  quantidade_produto
0                   1               1              1               300.0
1                   2               2              2               200.0
2                   3               4              3                 1.0
3                   4               3              4                 1.0
4                   5               5              3               100.0
5                   6               6              2               250.0
6                   7               5              4               100.0
7                   8               2              1               200.0
8                   9               1              2               200.0

### Objetivo: Obter todos os dados da tabela "FORNECEDOR_PRODUTO"

In [ ]:
pd.read_sql_query("select * from fornecedor_produto", conn)

   cod_fornecedor_produto  fk_cod_fornecedor  fk_cod_produto
0                       1                  1               1
1                       2                  1               2
2                       3                  2               5
3                       4                  3               3
4                       5                  3               6
5                       6                  4               4

### Objetivo: Obter todos os dados da tabela "PRODUTO"

In [ ]:
pd.read_sql_query("select * from produto", conn)

   cod_produto  fk_cod_tipo_produto  preco_produto    nome_produto
0            1                    1           7.79           Arroz
1            2                    1           5.99          Feijão
2            3                    4           3.79  Pasta de dente
3            4                    2          17.03     Antibiotico
4            5                    1          37.90           Peixe
5            6                    3           2.59    Desinfetante

### Objetivo: Obter todos os dados da tabela "TIPO_PRODUTO"

In [ ]:
pd.read_sql_query("select * from tipo_produto", conn)

   cod_tipo_produto nome_tipo_produto
0                 1       Alimenticio
1                 2         Medicinal
2                 3     Limpeza Geral
3                 4   Limpeza Pessoal